/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   Karen.cpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hkwon <hkwon@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/24 21:16:37 by hkwon             #+#    #+#             */
/*   Updated: 2021/11/24 21:21:58 by hkwon            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
이전 문제에서 크게 벗어날 필요 없이 멤버 함수 포인터를 담은 배열과 std::string을 담은 배열에 Filtering을 위한 함수와 요소를 각각 추가하면 된다.
지정된 Level 이상의 Logging들을 출력해야 하므로,
현재 Level을 찾은 뒤에 Filtering만 아니라면 loop를 통해 찾은 Level 이상의 Logging들을 간단히 출력할 수 있다.
*/
